uStepper/uStepperSTM32Hardware/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

# Upload menu

################################################################################
# uStepper Boards

uStepperSTM32.name=uStepper STM32 Boards

uStepperSTM32.build.core=arduino
uStepperSTM32.build.board=uStepper
uStepperSTM32.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
uStepperSTM32.build.mcu=cortex-m4
uStepperSTM32.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
uStepperSTM32.build.series=STM32F4xx
uStepperSTM32.build.cmsis_lib_gcc=arm_cortexM4lf_math

# uStepper S32
uStepperSTM32.menu.pnum.USTEPPER_S32=uStepper S32
uStepperSTM32.menu.pnum.USTEPPER_S32.upload.maximum_size=262144
uStepperSTM32.menu.pnum.USTEPPER_S32.upload.maximum_nvm_size=16384
uStepperSTM32.menu.pnum.USTEPPER_S32.upload.maximum_data_size=65536
uStepperSTM32.menu.pnum.USTEPPER_S32.build.board=USTEPPER_S32
uStepperSTM32.menu.pnum.USTEPPER_S32.build.product_line=STM32F401xC
uStepperSTM32.menu.pnum.USTEPPER_S32.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
uStepperSTM32.menu.pnum.USTEPPER_S32.build.variant_h=variant_{build.board}.h
uStepperSTM32.menu.pnum.USTEPPER_S32.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
uStepperSTM32.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
uStepperSTM32.menu.upload_method.dfuMethod.upload.protocol=2
uStepperSTM32.menu.upload_method.dfuMethod.upload.options=-g
uStepperSTM32.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

uStepperSTM32.menu.xserial.generic=Enabled (generic 'Serial')
uStepperSTM32.menu.xserial.none=Enabled (no generic 'Serial')
uStepperSTM32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
uStepperSTM32.menu.xserial.disabled=Disabled (no Serial support)
uStepperSTM32.menu.xserial.disabled.build.xSerial=

uStepperSTM32.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
uStepperSTM32.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
uStepperSTM32.menu.usb.none=None
uStepperSTM32.menu.usb.CDC=CDC (no generic 'Serial')
uStepperSTM32.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
uStepperSTM32.menu.usb.HID=HID (keyboard and mouse)
uStepperSTM32.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
uStepperSTM32.menu.xusb.FS=Low/Full Speed
uStepperSTM32.menu.xusb.HS=High Speed
uStepperSTM32.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
uStepperSTM32.menu.xusb.HSFS=High Speed in Full Speed mode
uStepperSTM32.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

uStepperSTM32.menu.opt.osstd=Smallest (-Os default)
uStepperSTM32.menu.opt.oslto=Smallest (-Os) with LTO
uStepperSTM32.menu.opt.oslto.build.flags.optimize=-Os -flto
uStepperSTM32.menu.opt.o1std=Fast (-O1)
uStepperSTM32.menu.opt.o1std.build.flags.optimize=-O1
uStepperSTM32.menu.opt.o1lto=Fast (-O1) with LTO
uStepperSTM32.menu.opt.o1lto.build.flags.optimize=-O1 -flto
uStepperSTM32.menu.opt.o2std=Faster (-O2)
uStepperSTM32.menu.opt.o2std.build.flags.optimize=-O2
uStepperSTM32.menu.opt.o2lto=Faster (-O2) with LTO
uStepperSTM32.menu.opt.o2lto.build.flags.optimize=-O2 -flto
uStepperSTM32.menu.opt.o3std=Fastest (-O3)
uStepperSTM32.menu.opt.o3std.build.flags.optimize=-O3
uStepperSTM32.menu.opt.o3lto=Fastest (-O3) with LTO
uStepperSTM32.menu.opt.o3lto.build.flags.optimize=-O3 -flto
uStepperSTM32.menu.opt.ogstd=Debug (-Og)
uStepperSTM32.menu.opt.ogstd.build.flags.optimize=-Og
uStepperSTM32.menu.opt.o0std=No Optimization (-O0)
uStepperSTM32.menu.opt.o0std.build.flags.optimize=-O0

uStepperSTM32.menu.dbg.none=None
uStepperSTM32.menu.dbg.enable=Enabled (-g)
uStepperSTM32.menu.dbg.enable.build.flags.debug=-g

# C Runtime Library

uStepperSTM32.menu.rtlib.nano=Newlib Nano (default)
uStepperSTM32.menu.rtlib.nanofp=Newlib Nano + Float Printf
uStepperSTM32.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
uStepperSTM32.menu.rtlib.nanofs=Newlib Nano + Float Scanf
uStepperSTM32.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
uStepperSTM32.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
uStepperSTM32.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
uStepperSTM32.menu.rtlib.full=Newlib Standard
uStepperSTM32.menu.rtlib.full.build.flags.ldspecs=